
writer = ('Лермонтов', 'Михалков', 'Тютчев', 'Блок', 'Есенин','Чехов','Маяковский', 'Маршак')

datas = ('15.10.1814', '13.03.1913','05.12.1820', '8.11.1880', '03.10.18', '29.01.1860', '19.07.1893', '03.11.1887')

random_writers = random.sample(writer, 5)
print(random_writers)


for writer in random_writers
otv = input (введите дату рождения в формате dd.mm.yyyy (writer): )

if otv.lower == (data[i])

months = {
    '01' = 'января'
    '02' = 'февраля'
    '03' = 'марта'
    '04' = 'апреля'
    '05' = 'мая'
    '06' = 'июня'
    '07' = 'июля'
    '08' = 'августа'
    '09' = 'сентября'
    '10' = 'октября'
    '11' = 'декабря'
}

days = {
    '01' = 'Первое'
    '02' = 'Второе'
    '03' = 'Третье'
    '04' = 'Четвертое'
    '05' = 'Пятое'
    '06' = 'Шестое'
    '07' = 'Седьмое'
    '08' = 'Восьмое'
    '09' = 'Девятое'
    '10' = 'Десятое'
    '11' = 'Одинадцатое'
    '12' = 'Двенадцатое'
    '13' = 'Тринадцатое'
    '14' = 'Четырнадцатое'
    '15' = 'Пятнадцатое'
    '16' = 'Шестнадцатое'
    '17' = 'Семнадцатое'
    '18' = 'Восемнадцатое'
    '19' = 'Девятнадцатое'
    '20' = 'Двадцатое'
    '21' = 'Двадцать первое'
    '22' = 'Двадцать второе'
    '23' = 'Двадцать третье'
    '24' = 'Двадцать четвертое'
    '25' = 'Двадцать пятое'
    '26' = 'Двадцать шестое'
    '27' = 'Двадцать седьмое'
    '28' = 'Двадцать восьмое'
    '29' = 'Двадцать девятое'
    '30' = 'Тридцатое'
    '31' = 'Тридцать певое'
}

random_writers = random.sample(writer, 5)
print(random_writers)




